01 IDENTIFICATION DIVISION.
02 PROGRAM-ID. HELLO.
03 DATA DIVISION.
04 WORKING-STORAGE SECTION.
05 01 WS-A PIC A(9) VALUE 'AsdwaASDR'.
06 01 WS-C PIC 9(2) VALUE 12.
06 01 WS-D PIC 9(2) VALUE 2.
07 PROCEDURE DIVISION.
08 A-PARA.
09 PERFORM B-PARA VARYING WS-A FROM 9 BY 3 UNTIL WS-A=12
10 STOP RUN.
11 B-PARA.
12 DISPLAY 'B-PARA ' WS-A4.
13 DISPLAY 'B-PARA'.
14 C-PARA.
15 PERFORM A-PARA VARYING WS-C FROM WS-A BY WS-D UNTIL WS-A=12.
16 STOP RUN.